app/controllers/api/v1/dica_controller.rb

SELECT  `dicas`.* FROM `dicas` WHERE `dicas`.`id` = 1 ORDER BY `dicas`.`id` ASC LIMIT 1
---
      def dicas
        unless params[:idMensagem].blank?
          dica = ::Dica.where(id: params[:idMensagem]).first